app/views/requests/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <td><%= request.attachment %></td>
        <% u=User.find(request.user_id) %>