app/controllers/requests_controller.rb

  def index
    if (current_user.department=="IT")
      @requests=Request.where(status:"approved")
    elsif(current_user.ismanager)
      @requests=Request.where(department: current_user.department)
---
SELECT "requests".* FROM "requests" WHERE "requests"."status" = ?  [["status", "approved"]]
SELECT  "requests".* FROM "requests" WHERE "requests"."department" = ? LIMIT ?  [["department", "jo"], ["LIMIT", 1]]

  def create
    @request = Request.new(request_params)
    @request.user_id = current_user.id
    user=User.find(@request.user_id)
    @request.department=user.department
    respond_to do |format|
      if @request.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "requests" ("title", "description", "attachment", "expected_date", "key_parameter", "cycle_time_reduction", "man_power_reduction", "created_at", "updated_at", "user_id", "department") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @request.update(request_params)
---
UPDATE "requests" SET "it_actual_date" = ?, "remarks" = ?, "it_status" = ?, "team_members" = ?, "updated_at" = ? WHERE "requests"."id" = ?  [["it_actual_date", "12/12/12"], ["remarks", "asdsfghngfbgf"], ["it_status", "in-progress"], ["team_members", "rohit gandu"], ["updated_at", "2018-07-13 16:39:32.332598"], ["id", 1]]

  def destroy
    @request.destroy
---
DELETE FROM "requests" WHERE "requests"."id" = ?  [["id", 1]]